==================
Basic usage
==================

query Items() {
  is(Box)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list)
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier))))))))

==================
Numbers
==================

query Items() {
  gt(120)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list)
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (number))))))

==================
Boolean
==================

query Items() {
  fn(true, false)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list)
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (true_literal)
          (false_literal))))))

==================
Uri
==================

query Items() {
  is(Box),
  eq(.size.height, 120)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list)
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier)))))
      (call
        callee: (identifier)
        arguments: (arguments
          (uri
            (identifier)
            (identifier))
          (number))))))

==================
Parameters
==================

query Items($size: number) {
  is(Box),
  eq(.size.height, $size)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list
      (parameter
        name: (parameter_name)
        type: (identifier)))
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier)))))
      (call
        callee: (identifier)
        arguments: (arguments
          (uri
            (identifier)
            (identifier))
          (variable base: (parameter_reference (parameter_name))))))))


==================
Variable field
==================

query Items($size: Size) {
  is(Box),
  eq(.size.height, $size.height)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list
      (parameter
        name: (parameter_name)
        type: (identifier)))
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier)))))
      (call
        callee: (identifier)
        arguments: (arguments
          (uri
            (identifier)
            (identifier))
          (variable
            base: (parameter_reference (parameter_name))
            field: (uri (identifier))))))))


==================
Variable nested field
==================

query Items($box: Box) {
  is(Box),
  eq(.size.height, $box.size.height)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list
      (parameter
        name: (parameter_name)
        type: (identifier)))
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier)))))
      (call
        callee: (identifier)
        arguments: (arguments
          (uri
            (identifier)
            (identifier))
          (variable
            base: (parameter_reference (parameter_name))
            field: (uri (identifier) (identifier))))))))


==================
Nested query
==================

query Items() {
  groupBy(.container, {
    sum()
  })
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list)
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (uri (identifier))
          (query
            (call
              callee: (identifier)
              arguments: (arguments))))))))

==================
Optional parameters
==================

query Items($size?: number) {
  is(Box),
  eq(.size.height, $size)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list
      (parameter
        name: (parameter_name)
        optional: (optional_flag)
        type: (identifier)))
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier)))))
      (call
        callee: (identifier)
        arguments: (arguments
          (uri
            (identifier)
            (identifier))
          (variable base: (parameter_reference (parameter_name))))))))

==================
Multiple parameters
==================

query Items($x: string, $size?: number,) {
  is(Box),
  eq(.size.height, $size)
}

---

(source_file
  (query_declaration
    name: (identifier)
    parameters: (parameters_list
      (parameter
        name: (parameter_name)
        type: (identifier))
      (parameter
        name: (parameter_name)
        optional: (optional_flag)
        type: (identifier)))
    body: (query
      (call
        callee: (identifier)
        arguments: (arguments
          (variable
            base: (type_reference
              (identifier)))))
      (call
        callee: (identifier)
        arguments: (arguments
          (uri
            (identifier)
            (identifier))
          (variable base: (parameter_reference (parameter_name))))))))